Repository: tanishasharma2140/yoyomiles_partner
Catalog: lib/l10n/app_*.arb
Languages: hi

source: India
hi: भारत

source: Change
hi: बदलें

# mob_no
source: Mobile number
hi: मोबाइल नंबर

# i_have_read
source: I have read and agreed to
hi: मैंने पढ़ लिया है और सहमत हूँ

# terms_condition
source: Terms and Conditions
hi: नियम और शर्तें

source: and
hi: और

source: Privacy Policy
hi: गोपनीयता नीति

# i_have_read_hereby
source: I have read and hereby provide my consent on the
hi: मैंने पढ़ लिया है और इसके लिए अपनी सहमति प्रदान करता/करती हूँ

source: TDS Declaration
hi: टीडीएस घोषणा

# please_enter_valid_ten
source: Please enter a valid 10-digit mobile number
hi: कृपया वैध 10 अंकों का मोबाइल नंबर दर्ज करें

# please_agree_to_all
source: Please agree to all terms and conditions to proceed
hi: आगे बढ़ने के लिए कृपया सभी नियम और शर्तों से सहमत हों

source: LOGIN
hi: लॉगिन

source: Video not available
hi: वीडियो उपलब्ध नहीं है

# watch_this_video
source: Watch this video to learn how to register and accept rides on the YoyoMiles Partner app.
hi: यह जानने के लिए यह वीडियो देखें कि YoyoMiles Partner ऐप पर कैसे पंजीकरण करें और राइड स्वीकार करें।

source: Watch Video
hi: वीडियो देखें

# otp
source: One Time Password (OTP) has been sent to this number
hi: वन टाइम पासवर्ड (OTP) इस नंबर पर भेज दिया गया है

source: Enter OTP
hi: OTP दर्ज करें

source: VERIFY
hi: सत्यापित करें

source: RESEND OTP
hi: OTP पुनः भेजें

source: Owner
hi: मालिक

source: Vehicle
hi: वाहन

source: Driver
hi: ड्राइवर

source: Name
hi: नाम

source: Enter Name
hi: नाम दर्ज करें

source: Upload the following *
hi: निम्नलिखित अपलोड करें *

# owner_aadhaar
source: Owner Aadhaar Card
hi: मालिक का आधार कार्ड

# owner_pan
source: Owner PAN Card
hi: मालिक का पैन कार्ड

source: Owner Selfie
hi: मालिक की सेल्फी

source: Front Side
hi: फ्रंट साइड

source: Back Side
hi: बैक साइड

source: Take Selfie
hi: सेल्फी लें

source: Submit
hi: सबमिट करें

source: Please Enter Name
hi: कृपया नाम दर्ज करें

# please_upload_both_aadhaar
source: Please upload both sides of Aadhaar card
hi: कृपया आधार कार्ड के दोनों तरफ की फोटो अपलोड करें

# please_upload_both_pan
source: Please upload both sides of PAN card
hi: कृपया पैन कार्ड के दोनों तरफ की फोटो अपलोड करें

source: Please upload selfie
hi: कृपया सेल्फी अपलोड करें

# file_size_to_large
source: File sizes too large. Please try with smaller images.
hi: फाइल का आकार बहुत बड़ा है। कृपया छोटी इमेज के साथ प्रयास करें।

source: Server error:
hi: सर्वर त्रुटि:

source: Submission failed:
hi: सबमिशन विफल:

source: Vehicle Detail
hi: वाहन विवरण

source: Select Delivery Type
hi: डिलीवरी प्रकार चुनें

source: Parcel Delivery
hi: पार्सल डिलीवरी

source: Passenger Delivery
hi: यात्री डिलीवरी

# no_vehicle_available
source: No vehicles available
hi: कोई वाहन उपलब्ध नहीं है

source: Select Vehicle Type
hi: वाहन प्रकार चुनें

# no_parcel_delivery_vehicle
source: No parcel delivery vehicles available
hi: कोई पार्सल डिलीवरी वाहन उपलब्ध नहीं है

# no_passenger_delivery_vehicle
source: No passenger delivery vehicles available
hi: कोई यात्री डिलीवरी वाहन उपलब्ध नहीं है

source: Select Vehicle Body Detail
hi: वाहन बॉडी विवरण चुनें

source: Select Vehicle Body Type
hi: वाहन बॉडी प्रकार चुनें

source: Select Vehicle Fuel Type
hi: वाहन का ईंधन प्रकार चुनें

# no_fuel_type_available
source: No fuel types available for this vehicle
hi: इस वाहन के लिए कोई ईंधन प्रकार उपलब्ध नहीं है

source: Please select a vehicle type first.
hi: कृपया पहले वाहन प्रकार चुनें।

# no_body_detail_available_for_this
source: No body details available for this vehicle
hi: इस वाहन के लिए कोई बॉडी विवरण उपलब्ध नहीं है

# no_fuel_type_avail
source: No fuel types available for this vehicle.
hi: इस वाहन के लिए कोई ईंधन प्रकार उपलब्ध नहीं है।

source: Vehicle Number *
hi: वाहन नंबर *

source: Enter Vehicle Number
hi: वाहन नंबर दर्ज करें

# vehicle_number_required
source: Vehicle number is required
hi: वाहन नंबर आवश्यक है

source: Enter valid vehicle number
hi: मान्य वाहन नंबर दर्ज करें

# select_city_of_operation
source: Select the city of operation
hi: संचालन का शहर चुनें

source: Search City
hi: शहर खोजें

source: Upload RC Document *
hi: आरसी दस्तावेज़ अपलोड करें *

# rc_front_uploaded
source: Front Uploaded
hi: फ्रंट अपलोड किया गया

# rc_front_side
source: Front Side
hi: फ्रंट साइड

# rc_back_uploaded
source: Back Uploaded
hi: बैक अपलोड किया गया

# rc_back_side
source: Back Side
hi: बैक साइड

source: Uploaded
hi: अपलोड किया गया

source: Pending
hi: लंबित

# continue_btn
source: Continue
hi: जारी रखें

source: Please enter vehicle number
hi: कृपया वाहन नंबर दर्ज करें

# please_upload_both_rc
source: Please upload both RC front and back
hi: कृपया आरसी के फ्रंट और बैक दोनों अपलोड करें

source: Please select city
hi: कृपया शहर चुनें

source: Please select vehicle type
hi: कृपया वाहन प्रकार चुनें

source: Please select vehicle body detail
hi: कृपया वाहन बॉडी विवरण चुनें

source: Please select body type
hi: कृपया बॉडी प्रकार चुनें

source: Please select fuel type
hi: कृपया ईंधन प्रकार चुनें

# profile_not_loaded
source: Profile not loaded. Try again.
hi: प्रोफ़ाइल लोड नहीं हुई। कृपया पुनः प्रयास करें।

source: Registration failed
hi: पंजीकरण विफल

# file_size_too_large
source: File sizes too large. Try smaller images.
hi: फाइल का आकार बहुत बड़ा है। कृपया छोटी इमेज का उपयोग करें।

# request_timeout
source: Request timeout. Check internet and try again.
hi: अनुरोध समय समाप्त। इंटरनेट जांचें और पुनः प्रयास करें।

# registration_failed_with_error
source: Registration failed:
hi: पंजीकरण विफल:

source: Error
hi: त्रुटि

source: OK
hi: ठीक है

# please_select_driver_option
source: Please select if you will be driving the vehicle
hi: कृपया चुनें कि क्या आप स्वयं वाहन चलाएंगे

source: Please enter driver name
hi: कृपया ड्राइवर का नाम दर्ज करें

source: Please upload front license
hi: कृपया लाइसेंस का फ्रंट अपलोड करें

source: Please upload back license
hi: कृपया लाइसेंस का बैक अपलोड करें

source: Add Driver Detail
hi: ड्राइवर विवरण जोड़ें

# i_will_be_driving_vehicle
source: I will be driving this vehicle *
hi: मैं यह वाहन चलाऊंगा/चलाऊंगी *

source: Yes
hi: हाँ

source: No
hi: नहीं

source: Driver Name:
hi: ड्राइवर का नाम:

source: Upload Driver License *
hi: ड्राइवर लाइसेंस अपलोड करें *

# license_front
source: Front
hi: फ्रंट

# license_back
source: Back
hi: बैक

# owner_detail_submitted
source: Owner details submitted successfully!
hi: मालिक की जानकारी सफलतापूर्वक सबमिट की गई!

source: Owner Details
hi: मालिक का विवरण

source: No data found
hi: कोई डेटा उपलब्ध नहीं है

source: Upload
hi: अपलोड करें

source: Exit App
hi: ऐप से बाहर निकलें

# are_you_sure_you_want
source: Are you sure you want to exit this app?
hi: क्या आप वाकई इस ऐप से बाहर निकलना चाहते हैं?

source: CANCEL
hi: रद्द करें

source: Exit
hi: बाहर निकलें

source: Pending dues found.
hi: बकाया राशि पाई गई है।

# account_deactivate
source: Account Deactivated
hi: खाता निष्क्रिय किया गया

# account_deactivated
source: Your account has been deactivated. Please contact the admin for assistance.
hi: आपका खाता निष्क्रिय कर दिया गया है। कृपया सहायता के लिए एडमिन से संपर्क करें।

# hi
source: Hii
hi: नमस्ते

source: Welcome to Yoyomiles
hi: Yoyomiles में आपका स्वागत है

# few_steps_away
source: You are now a few steps away from getting your first trip
hi: अब आप अपनी पहली यात्रा प्राप्त करने से बस कुछ कदम दूर हैं

# document_pending_approval
source: Your document has been successfully uploaded and is pending approval. Please wait while the review process is completed.
hi: आपका दस्तावेज़ सफलतापूर्वक अपलोड हो गया है और स्वीकृति के लिए लंबित है। कृपया समीक्षा प्रक्रिया पूरी होने तक प्रतीक्षा करें।

# foreground_location_permission_required
source: Foreground Location Access Permissions Required
hi: फोरग्राउंड लोकेशन एक्सेस अनुमति आवश्यक है

# location_permission_description
source: This app collects your location even when the app is closed or not in use to enable ride matching, show nearby ride requests, and keep you available while you are online as a driver.
hi: यह ऐप राइड मैचिंग सक्षम करने, पास की राइड रिक्वेस्ट दिखाने और ड्राइवर के रूप में ऑनलाइन रहते समय आपको उपलब्ध रखने के लिए ऐप बंद होने या उपयोग में न होने पर भी आपकी लोकेशन एकत्र करता है।

# location_permission_required
source: Location permission is required
hi: लोकेशन अनुमति आवश्यक है

source: Accept
hi: स्वीकार करें

source: Upload documents
hi: दस्तावेज़ अपलोड करें

# upload_documents_description
source: Driving licence, Aadhaar card, etc.
hi: ड्राइविंग लाइसेंस, आधार कार्ड आदि

source: Verified
hi: सत्यापित

source: Get your trip..!!
hi: अपनी यात्रा प्राप्त करें..!!

# voila_ready_for_trip
source: Voila! You are ready to do your trip
hi: वाह! आप अपनी यात्रा के लिए तैयार हैं

source: Go Online
hi: ऑनलाइन जाएं

source: Upload Again
hi: फिर से अपलोड करें

source: Profile
hi: प्रोफ़ाइल

source: Ride History
hi: राइड इतिहास

# wallet_and_settlement
source: Wallet & Settlement
hi: वॉलेट और सेटलमेंट

source: Earning Report
hi: कमाई रिपोर्ट

source: Professional Driver
hi: प्रोफेशनल ड्राइवर

source: Personal Information:
hi: व्यक्तिगत जानकारी:

source: Phone Number:
hi: फोन नंबर:

source: Owner Name:
hi: मालिक का नाम:

# vehicle_number_label
source: Vehicle Number:
hi: वाहन नंबर:

source: Vehicle Information:
hi: वाहन की जानकारी:

source: Vehicle Body Type:
hi: वाहन बॉडी प्रकार:

source: Vehicle Name:
hi: वाहन का नाम:

source: Aadhaar Card:
hi: आधार कार्ड:

source: PAN Card:
hi: पैन कार्ड:

source: Driving Licence
hi: ड्राइविंग लाइसेंस

source: RC Document
hi: आरसी दस्तावेज़

# confirm_logout
source: Are you sure you want to log out?
hi: क्या आप वाकई लॉग आउट करना चाहते हैं?

# logout_warning
source: You'll need to log in again to access your account.
hi: अपने खाते तक पहुँचने के लिए आपको फिर से लॉग इन करना होगा।

source: Log Out
hi: लॉग आउट

source: No rides yet
hi: अभी तक कोई राइड नहीं

# ride_history_placeholder
source: Your ride history will appear here
hi: आपका राइड इतिहास यहाँ दिखाई देगा

source: Sender Details
hi: प्रेषक विवरण

source: Phone
hi: फोन

source: Receiver Details
hi: प्राप्तकर्ता विवरण

source: Status
hi: स्थिति

source: Ride Completed
hi: राइड पूरी हुई

source: Cancelled by User
hi: उपयोगकर्ता द्वारा रद्द

source: Cancelled by Driver
hi: ड्राइवर द्वारा रद्द

source: None
hi: कोई नहीं

source: Ride Rating
hi: राइड रेटिंग

source: Not Available
hi: उपलब्ध नहीं

source: Pickup
hi: पिकअप

source: Location not specified
hi: स्थान निर्दिष्ट नहीं

source: Dropoff
hi: ड्रॉपऑफ

source: Available Balance
hi: उपलब्ध बैलेंस

source: Main Wallet
hi: मुख्य वॉलेट

source: Due Wallet
hi: बकाया वॉलेट

source: Withdraw
hi: निकालें

source: History
hi: इतिहास

source: Bank History
hi: बैंक इतिहास

source: Add Bank
hi: बैंक जोड़ें

source: Recent Transactions
hi: हाल की लेनदेन

source: Total Amount:
hi: कुल राशि:

source: Platform Fee:
hi: प्लेटफ़ॉर्म शुल्क:

source: Final Amount:
hi: अंतिम राशि:

source: Paid from User Wallet
hi: उपयोगकर्ता वॉलेट से भुगतान

source: Online Payment
hi: ऑनलाइन भुगतान

source: Due Payment
hi: बकाया भुगतान

source: Offline Payment
hi: ऑफलाइन भुगतान

source: From User Wallet
hi: उपयोगकर्ता वॉलेट से

source: Unknown
hi: अज्ञात

source: Online
hi: ऑनलाइन

source: Due
hi: बकाया

source: Offline
hi: ऑफलाइन

source: Wallet
hi: वॉलेट

source: Withdraw Funds
hi: राशि निकालें

source: Enter Amount
hi: राशि दर्ज करें

# no_bank_account_added
source: No bank account has been added, please add a bank account first.
hi: कोई बैंक खाता नहीं जोड़ा गया है, कृपया पहले बैंक खाता जोड़ें।

source: Earnings Report
hi: कमाई रिपोर्ट

source: Today
hi: आज

source: Weekly
hi: साप्ताहिक

source: Total Earnings
hi: कुल कमाई

source: This Week
hi: इस सप्ताह

source: Trips Completed
hi: पूर्ण राइड्स

source: Online Hours
hi: ऑनलाइन घंटे

source: Trip Details
hi: राइड विवरण

source: No trips available
hi: कोई राइड उपलब्ध नहीं है

source: Trip
hi: राइड

# are_yor_sure_go_offline
source: Are you sure you want to go offline?
hi: क्या आप वाकई ऑफलाइन जाना चाहते हैं?

# switch_online_later
source: You can always switch back online later.
hi: आप बाद में कभी भी फिर से ऑनलाइन हो सकते हैं।

# waiting_new_ride_request
source: Waiting for a new ride request…
hi: नई राइड रिक्वेस्ट का इंतजार हो रहा है…

# stay_online_receive_booking
source: Stay online and you'll receive a booking as soon as a customer requests a ride.
hi: ऑनलाइन रहें, ग्राहक द्वारा राइड अनुरोध करते ही आपको बुकिंग प्राप्त होगी।

source: Available Bookings
hi: उपलब्ध बुकिंग्स

source: Booking ID
hi: बुकिंग आईडी

source: Call
hi: कॉल

source: Ignore
hi: अनदेखा करें

source: Sender
hi: प्रेषक

source: Receiver
hi: प्राप्तकर्ता

source: Drop
hi: ड्रॉप

source: Payment Successful!
hi: भुगतान सफल!

# payment_received_thank_you
source: Payment has been successfully received. Thank you!
hi: भुगतान सफलतापूर्वक प्राप्त हुआ। धन्यवाद!

# ok_pressed_navigate_register
source: 🏠 OK pressed from success - Navigating to Register
hi: 🏠 सफलता के बाद OK दबाया गया - रजिस्टर पर जा रहे हैं

# ride_completed_celebration
source: Ride Completed! 🎉🎉
hi: राइड पूरी हुई! 🎉🎉

# ride_completed_successfully_thank_you
source: Your ride has been completed successfully. Thank you!
hi: आपकी राइड सफलतापूर्वक पूरी हो गई। धन्यवाद!

source: Ride Cancelled!
hi: राइड रद्द कर दी गई!

# ride_cancelled_by
source: Ride has been cancelled by
hi: राइड रद्द की गई द्वारा

# ride_completed_wallet
source: Ride completed successfully (Wallet)
hi: राइड सफलतापूर्वक पूरी हुई (वॉलेट)

source: Reached destination!
hi: गंतव्य पर पहुंच गए!

# ride_status_reached_destination
source: Ride status updated: Reached destination
hi: राइड स्टेटस अपडेट: गंतव्य पर पहुंच गए

# failed_update_ride_status
source: Failed to update ride status:
hi: राइड स्टेटस अपडेट करने में विफल:

source: OTP Verified
hi: OTP सत्यापित

# open_google_maps_navigation
source: You can now open Google Maps for navigation.
hi: अब आप नेविगेशन के लिए Google Maps खोल सकते हैं।

source: Go to Map
hi: मैप पर जाएं

source: Go to Pickup Location
hi: पिकअप स्थान पर जाएं

# open_google_maps_pickup
source: Open Google Maps to navigate to pickup location.
hi: पिकअप स्थान तक जाने के लिए Google Maps खोलें।

source: Could not open Google Maps
hi: Google Maps नहीं खोला जा सका

source: Start for Pickup
hi: पिकअप के लिए शुरू करें

source: Arrived at Pickup Point
hi: पिकअप पॉइंट पर पहुंचे

source: Start Ride
hi: राइड शुरू करें

source: Reached
hi: पहुँचे

source: Trip OTP Verification
hi: ट्रिप OTP सत्यापन

source: OTP verified! Ride started.
hi: OTP सत्यापित! राइड शुरू हुई।

source: Invalid OTP. Try again
hi: अमान्य OTP। फिर से प्रयास करें

source: Emergency
hi: आपातकाल

source: SOS
hi: एसओएस

# support_help_message
source: Hello Support, I need help with my ongoing ride.
hi: हेलो सपोर्ट, मुझे मेरी चल रही राइड में सहायता चाहिए।

source: Accepted by Driver
hi: ड्राइवर द्वारा स्वीकार

source: Out for PickUp
hi: पिकअप के लिए रवाना

source: At Pickup Point
hi: पिकअप पॉइंट पर

source: Ride Started
hi: राइड शुरू हुई

# reached_destination_status
source: Reached Destination
hi: गंतव्य पर पहुंचे

source: Payment Completed
hi: भुगतान पूर्ण

# ride_cancelled_status
source: Ride Cancelled
hi: राइड रद्द

source: Unknown Status
hi: अज्ञात स्थिति

source: No Active Ride
hi: कोई सक्रिय राइड नहीं

# no_active_ride_message
source: You don't have any active ride at the moment
hi: इस समय आपकी कोई सक्रिय राइड नहीं है

source: Vehicle Type
hi: वाहन प्रकार

source: Address
hi: पता

source: Current Status:
hi: वर्तमान स्थिति:

# ride_status_start_pickup
source: Ride status updated: Start for Pickup Location
hi: राइड स्टेटस अपडेट: पिकअप स्थान के लिए शुरू किया

# ride_status_arrived_pickup
source: Ride status updated: Arrived at Pickup Point
hi: राइड स्टेटस अपडेट: पिकअप पॉइंट पर पहुंचे

source: Reject
hi: अस्वीकार करें

source: Ride completed successfully!
hi: राइड सफलतापूर्वक पूरी हुई!

# failed_complete_ride
source: Failed to complete ride:
hi: राइड पूरी करने में विफल:

# failed_change_payment_mode
source: Failed to change payment mode:
hi: भुगतान मोड बदलने में विफल:

source: Change Payment Mode
hi: भुगतान मोड बदलें

source: Changing payment mode...
hi: भुगतान मोड बदला जा रहा है...

source: Cash Payment
hi: नकद भुगतान

source: Change Pay Mode
hi: भुगतान मोड बदलें

# collect_cash_from_customer
source: Please collect cash payment from customer
hi: कृपया ग्राहक से नकद भुगतान प्राप्त करें

source: Pay Done
hi: भुगतान पूरा

# payment_completed_celebration
source: Payment Completed! 🎉
hi: भुगतान पूर्ण! 🎉

# customer_completed_online_payment
source: Customer has successfully completed the online payment.
hi: ग्राहक ने ऑनलाइन भुगतान सफलतापूर्वक पूरा किया है।

# wait_for_customer_payment
source: Please wait while the customer completes the online payment.
hi: कृपया प्रतीक्षा करें जब तक ग्राहक ऑनलाइन भुगतान पूरा न कर ले।

source: Waiting for payment...
hi: भुगतान की प्रतीक्षा हो रही है...

source: Please enter OTP
hi: कृपया OTP दर्ज करें

source: Change Language
hi: भाषा बदलें
